# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib
read_verilog  /home/kali/Desktop/VLSI-Design/projects/HW_Trojans/NonHWT/source/non_hwt.v

# High-level synthesis
synth -top non_hwt
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
# Output buffering
iopadmap -outpad BUFX2 A:Y -bits
# Cleanup
opt
clean
rename -enumerate
write_verilog  non_hwt_mapped.v
stat
